l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/nxp/lpc176x_clk.c
    LPC_SC->PCLKSEL0  = PCLKSEL0_Val;     /* Peripheral Clock Selection         */
    LPC_SC->PCLKSEL1  = PCLKSEL1_Val;

    LPC_SC->CLKSRCSEL = CLKSRCSEL_Val;    /* Select Clock Source for PLL0       */

#if (PLL0_SETUP)
    LPC_SC->PLL0CFG   = PLL0CFG_Val;      /* configure PLL0                     */
    LPC_SC->PLL0FEED  = 0xAA;
    LPC_SC->PLL0FEED  = 0x55;

    LPC_SC->PLL0CON   = 0x01;             /* PLL0 Enable                        */
    LPC_SC->PLL0FEED  = 0xAA;
    LPC_SC->PLL0FEED  = 0x55;
    while (!(LPC_SC->PLL0STAT & (1<<26)));/* Wait for PLOCK0                    */

    LPC_SC->PLL0CON   = 0x03;             /* PLL0 Enable & Connect              */
    LPC_SC->PLL0FEED  = 0xAA;
    LPC_SC->PLL0FEED  = 0x55;
    while (!(LPC_SC->PLL0STAT & ((1<<25) | (1<<24))));/* Wait for PLLC0_STAT & PLLE0_STAT */
#endif

#if (PLL1_SETUP)
    LPC_SC->PLL1CFG   = PLL1CFG_Val;
    LPC_SC->PLL1FEED  = 0xAA;
    LPC_SC->PLL1FEED  = 0x55;

    LPC_SC->PLL1CON   = 0x01;             /* PLL1 Enable                        */
    LPC_SC->PLL1FEED  = 0xAA;
    LPC_SC->PLL1FEED  = 0x55;
    while (!(LPC_SC->PLL1STAT & (1<<10)));/* Wait for PLOCK1                    */

    LPC_SC->PLL1CON   = 0x03;             /* PLL1 Enable & Connect              */
    LPC_SC->PLL1FEED  = 0xAA;
    LPC_SC->PLL1FEED  = 0x55;
    while (!(LPC_SC->PLL1STAT & ((1<< 9) | (1<< 8))));/* Wait for PLLC1_STAT & PLLE1_STAT */
#else
    LPC_SC->USBCLKCFG = USBCLKCFG_Val;    /* Setup USB Clock Divider            */
#endif

    LPC_SC->PCONP     = PCONP_Val;        /* Power Control for Peripherals      */

    LPC_SC->CLKOUTCFG = CLKOUTCFG_Val;    /* Clock Output Configuration         */
#endif

#if (FLASH_SETUP == 1)                  /* Flash Accelerator Setup            */
    LPC_SC->FLASHCFG  = (LPC_SC->FLASHCFG & ~0x0000F000) | FLASHCFG_Val;
#endif

    SystemCoreClockUpdate();

    return rc;
}

/**
  * @brief  requests System clock frequency
  *
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
uint32_t SysCtlClockGet(void)
{
    SystemCoreClockUpdate();
    return SystemCoreClock;
}

/**
  * @brief  requests frequency of the given clock
  *
  * @param  idx NUT_HWCLK Index
  * @retval clock or 0 if idx points to an invalid clock
  */
uint32_t Lpc17xx_ClockGet(int idx)
{
    SystemCoreClockUpdate();
    switch(idx) {
        case NUT_HWCLK_CPU:
            return SystemCoreClock;
            break;

        case NUT_HWCLK_PCLK:
            /* peripheral base clock is the same as the CPU clock on LPC176x.
               Divided clocks (%1, 2, 4, 8) are possible */
            return SystemCoreClock;
            break;

        case NUT_HWCLK_EMC:
            return 0;
            break;

        case NUT_HWCLK_USB:
            /* Currently only the fixed 48Mhz clock is supported */
            return USBClock;
            break;
        default:
            return 0;
            break;
    }
}

int Lpc176x_PclkDivGet(int id)
{
    NUTASSERT((id & 0x01 != 0) || (id >= 64));

    if (id > 31) {
        id -= 32;
    }

    switch ((LPC_SC->PCLKSEL0 >> id) & 0x03) {
        case CLKPWR_PCLKSEL_CCLK_DIV_4:
            return 4;

        case CLKPWR_PCLKSEL_CCLK_DIV_1:
            return 1;

        case CLKPWR_PCLKSEL_CCLK_DIV_2:
            return 2;

        case CLKPWR_PCLKSEL_CCLK_DIV_8:
            if ((id != CLKPWR_PCLKSEL_CAN1) && (id != CLKPWR_PCLKSEL_CAN2)) {
                return 8;
            } else {
                return 6;
            }
    }
    /* Just to make the compiler happy */
    return 1;
}

void Lpc176x_PclkDivSet(int id, int div) {
    NUTASSERT((id & 0x01 != 0) || (id >= 64));
    NUTASSERT((div != 1) && (div != 2) && (div != 4) && (div != 6) && (div != 8));

    if (id > 31) {
        id -= 32;
    }

    LPC_SC->PCLKSEL0 &= ~(0x03 << id);
    switch (div) {
        case 1:
            LPC_SC->PCLKSEL0 |= (CLKPWR_PCLKSEL_CCLK_DIV_1 << id);
            break;
        case 2:
            LPC_SC->PCLKSEL0 |= (CLKPWR_PCLKSEL_CCLK_DIV_2 << id);
            break;
        case 4:
            LPC_SC->PCLKSEL0 |= (CLKPWR_PCLKSEL_CCLK_DIV_4 << id);
            break;
        case 6:
        case 8:
            LPC_SC->PCLKSEL0 |= (CLKPWR_PCLKSEL_CCLK_DIV_8 << id);
            break;
    }
}
